app/views/keyword_items/_item.html.erb

SELECT id, excerpt FROM "excerpts"
---
    <select name="item_id">
      <% Excerpt.select("id, excerpt").all.each do |object| %>