app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'test@fish.com' LIMIT 1
---
  def user_verify
    user = User.find_by_email(params["email"].downcase)