app/controllers/public_controller.rb

SELECT keyword FROM "keywords"
---
  def search
    @keywords = Keyword.select("keyword").to_a

SELECT "keywords".* FROM "keywords" WHERE "keywords"."keyword" = 'Ella Baker' LIMIT 1
---
  def keyword
    @keyword = params["keyword"]
    @results = Keyword.find_by_keyword(@keyword).items_array