app/views/public/search.html.erb

SELECT keyword FROM "keywords"
---
<% @keywords.each do |object| %>
  <% if object.keyword.length > 40 %>